Revit 2026 API

# RebarBarTypeSetHookOffsetLength Method

---

Identifies the hook offset length for a hook type

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetHookOffsetLength(
	ElementId hookId,
	double newLength
)
```
```vb
Public Sub SetHookOffsetLength (
	hookId As ElementId,
	newLength As Double
)
```
```cpp
public:
void SetHookOffsetLength(
	ElementId^ hookId,
	double newLength
)
```
```fsharp
member SetHookOffsetLength :
        hookId : ElementId *
        newLength : float -> unit
```

#### Parameters

hookId ElementId
     id of the hook type
newLength Double
     The hook offset length for a hook type

| Exception | Condition |
| --- | --- |
| ArgumentException | the rebar hook type id hookId is not valid -or- the hook specified by id hookId doesn't have valid offset length |
| ArgumentNullException | A non-optional argument was null |

AutoCalcHookLengths is ignored when this property is set

#### Reference

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace